comp-sci/theorem-provers/mizar/lie.org
#+TITLE: Lie Theory in Mizar
#+AUTHOR: Alex Nelson
#+EMAIL: pqnelson@gmail.com
#+DATE: <2022-02-17T09:11:39-08:00>
#+LANGUAGE: en
#+OPTIONS: H:5
#+HTML_DOCTYPE: html5
#+INCLUDE: ../../../org-macros.org
#+HTML_LINK_UP: ./index.html
#+HTML_LINK_HOME: ../../../index.html
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="../../../css/stylesheet.css" />
# Created Thursday February 17, 2022 at  9:11AM

* Overview
:PROPERTIES:
:CUSTOM_ID: h-0ff3dfee-375a-43d1-b8e5-fe1160a3383e
:END:

This is just a placeholder for my thinking about formalizing Lie
algebras and Lie groups in Mizar. On the whole, it seems following
Bourbaki's books may be the best outline/strategy.

* Relevant Definitions
:PROPERTIES:
:CUSTOM_ID: h-42b94e81-8319-49c1-ab2d-d8852a381f56
:END:

Mizar's library is /huge/, here's what I could find at a glance that's
relevant.

- [[http://mizar.org/version/current/html/polynom3.html][~polynom3~]] defines:
  - [[http://mizar.org/version/current/html/polynom3.html#NM1][~Polynomial of L~]] as ~AlgSequence of L~
- In [[http://mizar.org/version/current/html/polyalg1.html][~polyalg1~]], we have the following definitions
  - [[http://mizar.org/version/current/html/polyalg1.html#L1][~AlgebraStr over F~]] (which is both a "ring" (~doubleLoopStr~) and a
    ~ModuleStr~ over F)
  - [[http://mizar.org/version/current/html/polyalg1.html#NM1][~Algebra of L~]]
  - [[http://mizar.org/version/current/html/polyalg1.html#M1][~Subalgebra~]]
- In [[http://mizar.org/version/current/html/vectsp_1.html][~vectsp_1~]]:
  - [[http://mizar.org/version/current/html/vectsp_1.html#NM3][~Ring~]]
  - [[http://mizar.org/version/current/html/vectsp_1.html#NM4][~Skew-Field~]]
  - [[http://mizar.org/version/current/html/vectsp_1.html#NM5][~Field~]]
  - [[http://mizar.org/version/current/html/vectsp_1.html#L1][~ModuleStr~]]
  - [[http://mizar.org/version/current/html/vectsp_1.html#NM9][~VectSp~]]
- In [[http://mizar.org/version/current/html/vectsp_2.html][~vectsp_2~]]:
  - [[http://mizar.org/version/current/html/vectsp_2.html#L1][~RightModStr~]]
  - [[http://mizar.org/version/current/html/vectsp_2.html#NM5][~LeftMod~]]
  - [[http://mizar.org/version/current/html/vectsp_2.html#L2][~BiModStr~]]
- In [[http://mizar.org/version/current/html/ideal_1.html][~ideal_1~]]:
  - [[http://mizar.org/version/current/html/ideal_1.html#V2][~left-ideal~]]
  - [[http://mizar.org/version/current/html/ideal_1.html#V3][~right-ideal~]]

* References
:PROPERTIES:
:CUSTOM_ID: h-d95aeb61-2705-477a-bff1-5af409e21561
:END:

- Oliver Nash,\\
  "Formalising Lie algebras".\\
  {{{arXiv(2112.04570)}}}, 12 pages.
  + Discusses formalizing Lie algebras in Lean.
- Meinolf Geck,\\
  "On the construction of semisimple Lie algebras and Chevalley groups".\\
  {{{arXiv(1602.04583)}}}, 14 pages.
- Jean-Pierre Serre,\\
  /Complex semisimple Lie algebras/.\\
  Springer, 1987.