docs/comp-sci/theorem-provers/mizar/lie.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-02-17 Thu 09:16 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Lie Theory in Mizar</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Alex Nelson">
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../../../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Lie Theory in Mizar</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#h-0ff3dfee-375a-43d1-b8e5-fe1160a3383e">1. Overview</a></li>
<li><a href="#h-42b94e81-8319-49c1-ab2d-d8852a381f56">2. Relevant Definitions</a></li>
<li><a href="#h-d95aeb61-2705-477a-bff1-5af409e21561">3. References</a></li>
</ul>
</div>
</div>

<div id="outline-container-h-0ff3dfee-375a-43d1-b8e5-fe1160a3383e" class="outline-2">
<h2 id="h-0ff3dfee-375a-43d1-b8e5-fe1160a3383e"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-h-0ff3dfee-375a-43d1-b8e5-fe1160a3383e">
<p>
This is just a placeholder for my thinking about formalizing Lie
algebras and Lie groups in Mizar. On the whole, it seems following
Bourbaki's books may be the best outline/strategy.
</p>
</div>
</div>

<div id="outline-container-h-42b94e81-8319-49c1-ab2d-d8852a381f56" class="outline-2">
<h2 id="h-42b94e81-8319-49c1-ab2d-d8852a381f56"><span class="section-number-2">2</span> Relevant Definitions</h2>
<div class="outline-text-2" id="text-h-42b94e81-8319-49c1-ab2d-d8852a381f56">
<p>
Mizar's library is <i>huge</i>, here's what I could find at a glance that's
relevant. 
</p>

<ul class="org-ul">
<li><a href="http://mizar.org/version/current/html/polynom3.html"><code>polynom3</code></a> defines:
<ul class="org-ul">
<li><code>Polynomial of L</code> as <code>AlgSequence of L</code></li>
</ul></li>
<li>In <a href="http://mizar.org/version/current/html/polyalg1.html"><code>polyalg1</code></a>, we have the following definitions
<ul class="org-ul">
<li><code>Algebra over F</code> (which is both a "ring" (<code>doubleLoopStr</code>) and a
<code>ModuleStr</code> over F)</li>
<li><code>Subalgebra</code></li>
</ul></li>
<li>In <a href="http://mizar.org/version/current/html/vectsp_1.html"><code>vectsp_1</code></a>:
<ul class="org-ul">
<li><code>Ring</code></li>
<li><code>Skew-Field</code></li>
<li><code>Field</code></li>
<li><code>ModuleStr</code></li>
<li><code>VectSp</code></li>
</ul></li>
<li>In <a href="http://mizar.org/version/current/html/vectsp_2.html"><code>vectsp_2</code></a>:
<ul class="org-ul">
<li><code>RightModStr</code></li>
<li><code>LeftModStr</code></li>
<li><code>BiModStr</code></li>
</ul></li>
</ul>
</div>
</div>


<div id="outline-container-h-d95aeb61-2705-477a-bff1-5af409e21561" class="outline-2">
<h2 id="h-d95aeb61-2705-477a-bff1-5af409e21561"><span class="section-number-2">3</span> References</h2>
<div class="outline-text-2" id="text-h-d95aeb61-2705-477a-bff1-5af409e21561">
<ul class="org-ul">
<li>Oliver Nash,<br>
"Formalising Lie algebras".<br>
<a href="https://arxiv.org/abs/2112.04570">arXiv:2112.04570</a>, 12 pages.
<ul class="org-ul">
<li>Discusses formalizing Lie algebras in Lean.</li>
</ul></li>
<li>Meinolf Geck,<br>
"On the construction of semisimple Lie algebras and Chevalley groups".<br>
<a href="https://arxiv.org/abs/1602.04583">arXiv:1602.04583</a>, 14 pages.</li>
<li>Jean-Pierre Serre,<br>
<i>Complex semisimple Lie algebras</i>.<br>
Springer, 1987.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2022-02-17 Thu 09:16.</p>
</div>
</body>
</html>